zephyrproject-rtos/zephyr/subsys/mgmt/ec_host_cmd/backends/ec_host_cmd_backend_spi_stm32.c
/*
 * Copyright (c) 2023 Google LLC
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/* The SPI STM32 backend implements dedicated SPI driver for Host Commands. Unfortunately, the
 * current SPI API can't be used to handle the host commands communication. The main issues are
 * unknown command size sent by the host (the SPI transaction sends/receives specific number of
 * bytes) and need to constant sending status byte (the SPI module is enabled and disabled per
 * transaction), see https://github.com/zephyrproject-rtos/zephyr/issues/56091.
 */

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(host_cmd_spi, CONFIG_EC_HC_LOG_LEVEL);

#include <stm32_ll_spi.h>
#include <zephyr/device.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/spi.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/mgmt/ec_host_cmd/backend.h>
#include <zephyr/mgmt/ec_host_cmd/ec_host_cmd.h>
#include <zephyr/pm/policy.h>
#include <zephyr/pm/device.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/time_units.h>

/* The default compatible string of a SPI devicetree node has to be replaced with the one
 * dedicated for Host Commands. It disabled standard SPI driver. For STM32 SPI "st,stm32-spi" has
 * to be changed to "st,stm32-spi-host-cmd". The remaining "additional" compatible strings should
 * stay the same.
 */
#define ST_STM32_SPI_HOST_CMD_COMPAT st_stm32_spi_host_cmd
BUILD_ASSERT(DT_NODE_EXISTS(DT_CHOSEN(zephyr_host_cmd_spi_backend)),
	     "The chosen backend node is obligatory for SPI STM32 backend.");
BUILD_ASSERT(DT_NODE_HAS_COMPAT_STATUS(DT_CHOSEN(zephyr_host_cmd_spi_backend),
				       ST_STM32_SPI_HOST_CMD_COMPAT, okay),
	     "Invalid compatible of the chosen spi node.");

#define RX_HEADER_SIZE (sizeof(struct ec_host_cmd_request_header))

/* Framing byte which precedes a response packet from the EC. After sending a
 * request, the host will clock in bytes until it sees the framing byte, then
 * clock in the response packet.
 */
#define EC_SPI_FRAME_START 0xec

/* Padding bytes which are clocked out after the end of a response packet.*/
#define EC_SPI_PAST_END 0xed

/* The number of the ending bytes. The number can be bigger than 1 for chip families
 * than need to bypass the DMA threshold.
 */
#define EC_SPI_PAST_END_LENGTH 1

/* EC is ready to receive.*/
#define EC_SPI_RX_READY 0x78

/* EC has started receiving the request from the host, but hasn't started
 * processing it yet.
 */
#define EC_SPI_RECEIVING 0xf9

/* EC has received the entire request from the host and is processing it. */
#define EC_SPI_PROCESSING 0xfa

/* EC received bad data from the host, such as a packet header with an invalid
 * length. EC will ignore all data until chip select deasserts.
 */
#define EC_SPI_RX_BAD_DATA 0xfb

/* EC received data from the AP before it was ready. That is, the host asserted
 * chip select and started clocking data before the EC was ready to receive it.
 * EC will ignore all data until chip select deasserts.
 */
#define EC_SPI_NOT_READY 0xfc

/* Supported version of host commands protocol. */
#define EC_HOST_REQUEST_VERSION 3

/* Timeout to wait for SPI request packet
 *
 * This affects the slowest SPI clock we can support. A delay of 8192 us
 * permits a 512-byte request at 500 KHz, assuming the master starts sending
 * bytes as soon as it asserts chip select. That's as slow as we would
 * practically want to run the SPI interface, since running it slower
 * significantly impacts firmware update times.
 */
#define EC_SPI_CMD_RX_TIMEOUT_US 8192

#if DT_NODE_HAS_COMPAT(DT_CHOSEN(zephyr_host_cmd_spi_backend), st_stm32h7_spi)
#define EC_HOST_CMD_ST_STM32H7
#endif /* st_stm32h7_spi */

#if DT_NODE_HAS_COMPAT(DT_CHOSEN(zephyr_host_cmd_spi_backend), st_stm32_spi_fifo)
#define EC_HOST_CMD_ST_STM32_FIFO
#endif /* st_stm32_spi_fifo */

#define STM32_DMA_FEATURES_ID(id, dir) DT_DMAS_CELL_BY_NAME_OR(id, dir, features, 0)

#if DT_CLOCKS_HAS_IDX(DT_CHOSEN(zephyr_host_cmd_spi_backend), 1)
#define STM32_EC_HOST_CMD_SPI_DOMAIN_CLOCK_SUPPORT 1
#else
#define STM32_EC_HOST_CMD_SPI_DOMAIN_CLOCK_SUPPORT 0
#endif

/*
 * Max data size for a version 3 request/response packet.  This is big enough
 * to handle a request/response header, flash write offset/size, and 512 bytes
 * of flash data.
 */
#define SPI_MAX_REQ_SIZE  0x220
#define SPI_MAX_RESP_SIZE 0x220

/* Enumeration to maintain different states of incoming request from
 * host
 */
enum spi_host_command_state {
	/* SPI not enabled (initial state, and when chipset is off) */
	SPI_HOST_CMD_STATE_DISABLED = 0,

	/* SPI module enabled, but not ready to receive */
	SPI_HOST_CMD_STATE_RX_NOT_READY,

	/* Ready to receive next request */
	SPI_HOST_CMD_STATE_READY_TO_RX,

	/* Receiving request */
	SPI_HOST_CMD_STATE_RECEIVING,

	/* Processing request */
	SPI_HOST_CMD_STATE_PROCESSING,

	/* Sending response */
	SPI_HOST_CMD_STATE_SENDING,

	/* Received bad data - transaction started before we were ready, or
	 * packet header from host didn't parse properly. Ignoring received
	 * data.
	 */
	SPI_HOST_CMD_STATE_RX_BAD,
};

struct dma_stream {
	const struct device *dma_dev;
	uint32_t channel;
	struct dma_config dma_cfg;
	struct dma_block_config dma_blk_cfg;
	int fifo_threshold;
};

struct ec_host_cmd_spi_cfg {
	SPI_TypeDef *spi;
	const struct pinctrl_dev_config *pcfg;
	const struct stm32_pclken *pclken;
	size_t pclk_len;
};

struct ec_host_cmd_spi_ctx {
	struct gpio_dt_spec cs;
	struct gpio_callback cs_callback;
	struct ec_host_cmd_spi_cfg *spi_config;
	struct ec_host_cmd_rx_ctx *rx_ctx;
	struct ec_host_cmd_tx_buf *tx;
	uint8_t *tx_buf;
	struct dma_stream *dma_rx;
	struct dma_stream *dma_tx;
	enum spi_host_command_state state;
	int prepare_rx_later;
#ifdef CONFIG_PM
	ATOMIC_DEFINE(pm_policy_lock_on, 1);
#endif /* CONFIG_PM */
};

static const uint8_t out_preamble[4] = {
	EC_SPI_PROCESSING, EC_SPI_PROCESSING, EC_SPI_PROCESSING,
	EC_SPI_FRAME_START, /* This is the byte which matters */
};

