zephyrproject-rtos/zephyr/subsys/mgmt/ec_host_cmd/backends/ec_host_cmd_backend_spi_stm32.c
static void dma_callback(const struct device *dev, void *arg, uint32_t channel, int status);
static int prepare_rx(struct ec_host_cmd_spi_ctx *hc_spi);

#define SPI_DMA_CHANNEL_INIT(id, dir, dir_cap, src_dev, dest_dev)                                  \
	.dma_dev = DEVICE_DT_GET(DT_DMAS_CTLR_BY_NAME(id, dir)),                                   \
	.channel = DT_DMAS_CELL_BY_NAME(id, dir, channel),                                         \
	.dma_cfg =                                                                                 \
		{                                                                                  \
			.dma_slot = DT_DMAS_CELL_BY_NAME(id, dir, slot),                           \
			.channel_direction = STM32_DMA_CONFIG_DIRECTION(                           \
				DT_DMAS_CELL_BY_NAME(id, dir, channel_config)),                    \
			.source_data_size = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(                \
				DT_DMAS_CELL_BY_NAME(id, dir, channel_config)),                    \
			.dest_data_size = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(                 \
				DT_DMAS_CELL_BY_NAME(id, dir, channel_config)),                    \
			/* single transfers (burst length = data size) */                          \
			.source_burst_length = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(             \
				DT_DMAS_CELL_BY_NAME(id, dir, channel_config)),                    \
			.dest_burst_length = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(              \
				DT_DMAS_CELL_BY_NAME(id, dir, channel_config)),                    \
			.channel_priority = STM32_DMA_CONFIG_PRIORITY(                             \
				DT_DMAS_CELL_BY_NAME(id, dir, channel_config)),                    \
			.dma_callback = dma_callback,                                              \
			.block_count = 2,                                                          \
	},                                                                                         \
	.fifo_threshold = STM32_DMA_FEATURES_FIFO_THRESHOLD(STM32_DMA_FEATURES_ID(id, dir)),

#define STM32_SPI_INIT(id)                                                                         \
	PINCTRL_DT_DEFINE(id);                                                                     \
	static const struct stm32_pclken pclken[] = STM32_DT_CLOCKS(id);                           \
                                                                                                   \
	static struct ec_host_cmd_spi_cfg ec_host_cmd_spi_cfg = {                                  \
		.spi = (SPI_TypeDef *)DT_REG_ADDR(id),                                             \
		.pcfg = PINCTRL_DT_DEV_CONFIG_GET(id),                                             \
		.pclken = pclken,                                                                  \
		.pclk_len = DT_NUM_CLOCKS(id),                                                     \
	};                                                                                         \
                                                                                                   \
	static struct dma_stream dma_rx = {SPI_DMA_CHANNEL_INIT(id, rx, RX, PERIPHERAL, MEMORY)};  \
	static struct dma_stream dma_tx = {SPI_DMA_CHANNEL_INIT(id, tx, TX, MEMORY, PERIPHERAL)}

STM32_SPI_INIT(DT_CHOSEN(zephyr_host_cmd_spi_backend));

#define EC_HOST_CMD_SPI_DEFINE(_name)                                                              \
	static struct ec_host_cmd_spi_ctx _name##_hc_spi = {                                       \
		.dma_rx = &dma_rx,                                                                 \
		.dma_tx = &dma_tx,                                                                 \
		.spi_config = &ec_host_cmd_spi_cfg,                                                \
	};                                                                                         \
	struct ec_host_cmd_backend _name = {                                                       \
		.api = &ec_host_cmd_api,                                                           \
		.ctx = (struct ec_host_cmd_spi_ctx *)&_name##_hc_spi,                              \
	}

static inline uint32_t dma_source_addr(SPI_TypeDef *spi)
{
#ifdef EC_HOST_CMD_ST_STM32H7
	return (uint32_t)(&spi->RXDR);
#else
	return (uint32_t)LL_SPI_DMA_GetRegAddr(spi);
#endif /* EC_HOST_CMD_ST_STM32H7 */
}

static inline uint32_t dma_dest_addr(SPI_TypeDef *spi)
{
#ifdef EC_HOST_CMD_ST_STM32H7
	return (uint32_t)(&spi->TXDR);
#else
	return (uint32_t)LL_SPI_DMA_GetRegAddr(spi);
#endif /* EC_HOST_CMD_ST_STM32H7 */
}

/* Set TX register to send status, while SPI module is enabled */
static inline void tx_status(SPI_TypeDef *spi, uint8_t status)
{
	/* The number of status bytes to sent can be bigger than 1 for chip
	 * families than need to bypass the DMA threshold.
	 */
	LL_SPI_TransmitData8(spi, status);
#ifdef EC_HOST_CMD_ST_STM32H7
	LL_SPI_SetUDRPattern(spi, status);
#endif /* EC_HOST_CMD_ST_STM32H7 */
}

static int expected_size(const struct ec_host_cmd_request_header *header)
{
	/* Check host request version */
	if (header->prtcl_ver != EC_HOST_REQUEST_VERSION) {
		return 0;
	}

	/* Reserved byte should be 0 */
	if (header->reserved) {
		return 0;
	}

	return sizeof(*header) + header->data_len;
}

#ifdef CONFIG_PM
static void ec_host_cmd_pm_policy_state_lock_get(struct ec_host_cmd_spi_ctx *hc_spi)
{
	if (!atomic_test_and_set_bit(hc_spi->pm_policy_lock_on, 0)) {
		pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	}
}

static void ec_host_cmd_pm_policy_state_lock_put(struct ec_host_cmd_spi_ctx *hc_spi)
{
	if (atomic_test_and_clear_bit(hc_spi->pm_policy_lock_on, 0)) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	}
}
#else
static inline void ec_host_cmd_pm_policy_state_lock_get(struct ec_host_cmd_spi_ctx *hc_spi)
{
	ARG_UNUSED(hc_spi);
}

static void ec_host_cmd_pm_policy_state_lock_put(struct ec_host_cmd_spi_ctx *hc_spi)
{
	ARG_UNUSED(hc_spi);
}
#endif /* CONFIG_PM */

static void dma_callback(const struct device *dev, void *arg, uint32_t channel, int status)
{
	struct ec_host_cmd_spi_ctx *hc_spi = arg;

	/* End of sending */
	if (channel == hc_spi->dma_tx->channel) {
		if (hc_spi->prepare_rx_later) {
			int ret;

			ret = prepare_rx(hc_spi);

			if (ret) {
				LOG_ERR("Failed to prepare RX later");
			}
		} else {
			const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
			SPI_TypeDef *spi = cfg->spi;

			/* Set the status not ready. Prepare RX after CS deassertion */
			tx_status(spi, EC_SPI_NOT_READY);
			hc_spi->state = SPI_HOST_CMD_STATE_RX_NOT_READY;
		}
	}
}

static int spi_init(const struct ec_host_cmd_spi_ctx *hc_spi)
{
	int err;

	if (!device_is_ready(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE))) {
		LOG_ERR("Clock control device not ready");
		return -ENODEV;
	}

