zephyrproject-rtos/zephyr/subsys/mgmt/ec_host_cmd/backends/ec_host_cmd_backend_spi_stm32.c
	err = clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
			       (clock_control_subsys_t)&hc_spi->spi_config->pclken[0]);
	if (err < 0) {
		LOG_ERR("Could not enable SPI clock");
		return err;
	}

	if (IS_ENABLED(STM32_EC_HOST_CMD_SPI_DOMAIN_CLOCK_SUPPORT) &&
	    hc_spi->spi_config->pclk_len > 1) {
		err = clock_control_configure(
			DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
			(clock_control_subsys_t)&hc_spi->spi_config->pclken[1], NULL);
		if (err < 0) {
			LOG_ERR("Could not select SPI domain clock");
			return err;
		}
	}

	/* Configure dt provided device signals when available */
	err = pinctrl_apply_state(hc_spi->spi_config->pcfg, PINCTRL_STATE_DEFAULT);
	if (err < 0) {
		LOG_ERR("SPI pinctrl setup failed (%d)", err);
		return err;
	}

	if ((hc_spi->dma_rx->dma_dev != NULL) && !device_is_ready(hc_spi->dma_rx->dma_dev)) {
		LOG_ERR("%s device not ready", hc_spi->dma_rx->dma_dev->name);
		return -ENODEV;
	}

	if ((hc_spi->dma_tx->dma_dev != NULL) && !device_is_ready(hc_spi->dma_tx->dma_dev)) {
		LOG_ERR("%s device not ready", hc_spi->dma_tx->dma_dev->name);
		return -ENODEV;
	}

	return 0;
}

static int spi_configure(const struct ec_host_cmd_spi_ctx *hc_spi)
{
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;

#if defined(LL_SPI_PROTOCOL_MOTOROLA) && defined(SPI_CR2_FRF)
	LL_SPI_SetStandard(spi, LL_SPI_PROTOCOL_MOTOROLA);
#endif

	/* Disable before configuration */
	LL_SPI_Disable(spi);
	/* Set clock signal configuration */
	LL_SPI_SetClockPolarity(spi, LL_SPI_POLARITY_LOW);
	LL_SPI_SetClockPhase(spi, LL_SPI_PHASE_1EDGE);
	/* Set protocol parameters */
	LL_SPI_SetTransferDirection(spi, LL_SPI_FULL_DUPLEX);
	LL_SPI_SetTransferBitOrder(spi, LL_SPI_MSB_FIRST);
	LL_SPI_DisableCRC(spi);
	LL_SPI_SetDataWidth(spi, LL_SPI_DATAWIDTH_8BIT);
	/* Set slave options */
	LL_SPI_SetNSSMode(spi, LL_SPI_NSS_HARD_INPUT);
	LL_SPI_SetMode(spi, LL_SPI_MODE_SLAVE);

#ifdef EC_HOST_CMD_ST_STM32H7
	LL_SPI_SetUDRConfiguration(spi, LL_SPI_UDR_CONFIG_REGISTER_PATTERN);
	LL_SPI_SetUDRDetection(spi, LL_SPI_UDR_DETECT_END_DATA_FRAME);
#endif /* EC_HOST_CMD_ST_STM32H7 */

#ifdef EC_HOST_CMD_ST_STM32_FIFO
#ifdef EC_HOST_CMD_ST_STM32H7
	LL_SPI_SetFIFOThreshold(spi, LL_SPI_FIFO_TH_01DATA);
#else
	LL_SPI_SetRxFIFOThreshold(spi, LL_SPI_RX_FIFO_TH_QUARTER);
#endif /* EC_HOST_CMD_ST_STM32H7 */
#endif /* EC_HOST_CMD_ST_STM32_FIFO */

	return 0;
}

static int reload_dma_tx(struct ec_host_cmd_spi_ctx *hc_spi, size_t len)
{
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;
	int ret;

	/* Set DMA at the beginning of the TX buffer and set the number of bytes to send */
	ret = dma_reload(hc_spi->dma_tx->dma_dev, hc_spi->dma_tx->channel, (uint32_t)hc_spi->tx_buf,
			 dma_dest_addr(spi), len);
	if (ret != 0) {
		return ret;
	}

	/* Start DMA transfer */
	ret = dma_start(hc_spi->dma_tx->dma_dev, hc_spi->dma_tx->channel);
	if (ret != 0) {
		return ret;
	}
#ifdef EC_HOST_CMD_ST_STM32H7
	LL_SPI_ClearFlag_UDR(spi);
#endif

	return 0;
}

static int spi_config_dma_tx(struct ec_host_cmd_spi_ctx *hc_spi)
{
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;
	struct dma_block_config *blk_cfg;
	struct dma_stream *stream = hc_spi->dma_tx;
	int ret;

	blk_cfg = &stream->dma_blk_cfg;

	/* Set configs for TX. This shouldn't be changed during communication */
	memset(blk_cfg, 0, sizeof(struct dma_block_config));
	blk_cfg->block_size = 0;

	/* The destination address is the SPI register */
	blk_cfg->dest_address = dma_dest_addr(spi);
	blk_cfg->dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;

	blk_cfg->source_address = (uint32_t)hc_spi->tx_buf;
	blk_cfg->source_addr_adj = DMA_ADDR_ADJ_INCREMENT;

	blk_cfg->fifo_mode_control = hc_spi->dma_tx->fifo_threshold;

	stream->dma_cfg.head_block = blk_cfg;
	stream->dma_cfg.user_data = hc_spi;

	/* Configure the TX the channels */
	ret = dma_config(hc_spi->dma_tx->dma_dev, hc_spi->dma_tx->channel, &stream->dma_cfg);

	if (ret != 0) {
		return ret;
	}

	return 0;
}

static int reload_dma_rx(struct ec_host_cmd_spi_ctx *hc_spi)
{
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;
	int ret;

	/* Reload DMA to the beginning of the RX buffer */
	ret = dma_reload(hc_spi->dma_rx->dma_dev, hc_spi->dma_rx->channel, dma_source_addr(spi),
			 (uint32_t)hc_spi->rx_ctx->buf, CONFIG_EC_HOST_CMD_HANDLER_RX_BUFFER_SIZE);
	if (ret != 0) {
		return ret;
	}

	ret = dma_start(hc_spi->dma_rx->dma_dev, hc_spi->dma_rx->channel);
	if (ret != 0) {
		return ret;
	}

	return 0;
}

static int spi_config_dma_rx(struct ec_host_cmd_spi_ctx *hc_spi)
{
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;
	struct dma_block_config *blk_cfg;
	struct dma_stream *stream = hc_spi->dma_rx;
	int ret;

	blk_cfg = &stream->dma_blk_cfg;

	/* Set configs for RX. This shouldn't be changed during communication */
	memset(blk_cfg, 0, sizeof(struct dma_block_config));
	blk_cfg->block_size = CONFIG_EC_HOST_CMD_HANDLER_RX_BUFFER_SIZE;

	/* The destination address is our RX buffer */
	blk_cfg->dest_address = (uint32_t)hc_spi->rx_ctx->buf;
	blk_cfg->dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;

	/* The source address is the SPI register */
	blk_cfg->source_address = dma_source_addr(spi);
	blk_cfg->source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;

	blk_cfg->fifo_mode_control = hc_spi->dma_rx->fifo_threshold;

	stream->dma_cfg.head_block = blk_cfg;
	stream->dma_cfg.user_data = hc_spi;

	/* Configure the RX the channels */
	ret = dma_config(hc_spi->dma_rx->dma_dev, hc_spi->dma_rx->channel, &stream->dma_cfg);

	return ret;
}

static int prepare_rx(struct ec_host_cmd_spi_ctx *hc_spi)
{
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;
	int ret;

	hc_spi->prepare_rx_later = 0;

#ifdef EC_HOST_CMD_ST_STM32H7
	/* As described in RM0433 "To restart the internal state machine
	 * properly, SPI is strongly suggested to be disabled and re-enabled
	 * before next transaction starts despite its setting is not changed.",
	 * disable and re-enable the SPI module. Without that, the SPI module
	 * receives the first byte on a next transaction incorrectly - it is
	 * always 0x00.
	 * It also clears RX FIFO, so there is no needed to read the remaining
	 * bytes manually.
	 */
	LL_SPI_Disable(spi);
	LL_SPI_Enable(spi);
#else  /* EC_HOST_CMD_ST_STM32H7 */
	/* Flush RX buffer. It clears the RXNE(RX not empty) flag not to trigger
	 * the DMA transfer at the beginning of a new SPI transfer. The flag is
	 * set while sending response to host. The number of bytes to read can
	 * be bigger than 1 for chip families than need to bypass the DMA
	 * threshold.
	 */
	LL_SPI_ReceiveData8(spi);
#endif /* EC_HOST_CMD_ST_STM32H7 */

