zephyrproject-rtos/zephyr/subsys/mgmt/ec_host_cmd/backends/ec_host_cmd_backend_spi_stm32.c
	ret = reload_dma_rx(hc_spi);
	if (!ret) {
		tx_status(spi, EC_SPI_RX_READY);
		hc_spi->state = SPI_HOST_CMD_STATE_READY_TO_RX;
	}

	return ret;
}

static int spi_setup_dma(struct ec_host_cmd_spi_ctx *hc_spi)
{
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;
	/* retrieve active RX DMA channel (used in callback) */
	int ret;

#ifdef EC_HOST_CMD_ST_STM32H7
	/* Set request before enabling (else SPI CFG1 reg is write protected) */
	LL_SPI_EnableDMAReq_RX(spi);
	LL_SPI_EnableDMAReq_TX(spi);

	LL_SPI_Enable(spi);
#else  /* EC_HOST_CMD_ST_STM32H7 */
	LL_SPI_Enable(spi);
#endif /* !EC_HOST_CMD_ST_STM32H7 */

	ret = spi_config_dma_tx(hc_spi);
	if (ret != 0) {
		return ret;
	}

	ret = spi_config_dma_rx(hc_spi);
	if (ret != 0) {
		return ret;
	}

	/* Start receiving from the SPI Master */
	ret = dma_start(hc_spi->dma_rx->dma_dev, hc_spi->dma_rx->channel);
	if (ret != 0) {
		return ret;
	}

#ifndef EC_HOST_CMD_ST_STM32H7
	/* toggle the DMA request to restart the transfer */
	LL_SPI_EnableDMAReq_RX(spi);
	LL_SPI_EnableDMAReq_TX(spi);
#endif /* !EC_HOST_CMD_ST_STM32H7 */

	return 0;
}

static int wait_for_rx_bytes(struct ec_host_cmd_spi_ctx *hc_spi, int needed)
{
	int64_t deadline = k_ticks_to_us_floor64(k_uptime_ticks()) + EC_SPI_CMD_RX_TIMEOUT_US;
	int64_t current_time;
	struct dma_status stat;
	int ret;

	while (1) {
		uint32_t rx_bytes;

		current_time = k_ticks_to_us_floor64(k_uptime_ticks());

		ret = dma_get_status(hc_spi->dma_rx->dma_dev, hc_spi->dma_rx->channel, &stat);
		/* RX DMA is always programmed to copy buffer size (max command size) */
		if (ret) {
			return ret;
		}

		rx_bytes = CONFIG_EC_HOST_CMD_HANDLER_RX_BUFFER_SIZE - stat.pending_length;
		if (rx_bytes >= needed) {
			return 0;
		}

		/* Make sure the SPI transfer is ongoing */
		ret = gpio_pin_get(hc_spi->cs.port, hc_spi->cs.pin);
		if (ret) {
			/* End of transfer - return instantly */
			return ret;
		}

		if (current_time >= deadline) {
			/* Timeout */
			return -EIO;
		}
	}
}

void gpio_cb_nss(const struct device *port, struct gpio_callback *cb, gpio_port_pins_t pins)
{
	struct ec_host_cmd_spi_ctx *hc_spi =
		CONTAINER_OF(cb, struct ec_host_cmd_spi_ctx, cs_callback);
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;
	int ret;

	/* CS deasserted. Setup for the next transaction */
	if (gpio_pin_get(hc_spi->cs.port, hc_spi->cs.pin)) {
		ec_host_cmd_pm_policy_state_lock_put(hc_spi);

		/* CS asserted during processing a command. Prepare for receiving after
		 * sending response.
		 */
		if (hc_spi->prepare_rx_later || hc_spi->state == SPI_HOST_CMD_STATE_PROCESSING) {
			hc_spi->prepare_rx_later = 1;
			return;
		}

		ret = prepare_rx(hc_spi);
		if (ret) {
			LOG_ERR("Failed to prepare RX after CS deassertion");
		}

		return;
	}

	/* CS asserted. Receive full packet and call general handler */
	if (hc_spi->state == SPI_HOST_CMD_STATE_READY_TO_RX) {
		/* The SPI module and DMA are already configured and ready to receive data.
		 * Consider disabling the SPI module at the end of sending response and
		 * reenabling it here if there is a need to disable reset SPI module,
		 * because of unexpected states.
		 */
		int exp_size;

		hc_spi->state = SPI_HOST_CMD_STATE_RECEIVING;
		/* Don't allow system to suspend until the end of transfer. */
		ec_host_cmd_pm_policy_state_lock_get(hc_spi);

		/* Set TX register to send status */
		tx_status(spi, EC_SPI_RECEIVING);

		/* Get the header */
		if (wait_for_rx_bytes(hc_spi, RX_HEADER_SIZE)) {
			goto spi_bad_rx;
		}

		exp_size = expected_size((struct ec_host_cmd_request_header *)hc_spi->rx_ctx->buf);
		/* Get data bytes */
		if (exp_size > RX_HEADER_SIZE) {
			if (wait_for_rx_bytes(hc_spi, exp_size)) {
				goto spi_bad_rx;
			}
		}

		hc_spi->rx_ctx->len = exp_size;
		hc_spi->state = SPI_HOST_CMD_STATE_PROCESSING;
		hc_spi->prepare_rx_later = 1;
		tx_status(spi, EC_SPI_PROCESSING);
		ec_host_cmd_rx_notify();

		return;
	}

spi_bad_rx:
	tx_status(spi, EC_SPI_NOT_READY);
	if (hc_spi->state != SPI_HOST_CMD_STATE_PROCESSING && !hc_spi->prepare_rx_later) {
		hc_spi->state = SPI_HOST_CMD_STATE_RX_BAD;
	}
}

static int ec_host_cmd_spi_init(const struct ec_host_cmd_backend *backend,
				struct ec_host_cmd_rx_ctx *rx_ctx, struct ec_host_cmd_tx_buf *tx)
{
	int ret;
	struct ec_host_cmd_spi_ctx *hc_spi = (struct ec_host_cmd_spi_ctx *)backend->ctx;
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	SPI_TypeDef *spi = cfg->spi;

	hc_spi->state = SPI_HOST_CMD_STATE_DISABLED;

	/* SPI backend needs rx and tx buffers provided by the handler */
	if (!rx_ctx->buf || !tx->buf || !hc_spi->cs.port) {
		return -EIO;
	}

	hc_spi->rx_ctx = rx_ctx;
	hc_spi->rx_ctx->len = 0;

	/* Buffer to transmit */
	hc_spi->tx_buf = tx->buf;
	hc_spi->tx = tx;
	/* Buffer for response from HC handler. Make space for preamble */
	hc_spi->tx->buf = (uint8_t *)hc_spi->tx->buf + sizeof(out_preamble);
	hc_spi->tx->len_max = hc_spi->tx->len_max - sizeof(out_preamble) - EC_SPI_PAST_END_LENGTH;

	/* Limit the request/response max sizes */
	if (hc_spi->rx_ctx->len_max > SPI_MAX_REQ_SIZE) {
		hc_spi->rx_ctx->len_max = SPI_MAX_REQ_SIZE;
	}
	if (hc_spi->tx->len_max > SPI_MAX_RESP_SIZE) {
		hc_spi->tx->len_max = SPI_MAX_RESP_SIZE;
	}

	ret = spi_init(hc_spi);
	if (ret) {
		return ret;
	}

	ret = spi_configure(hc_spi);
	if (ret) {
		return ret;
	}

	ret = spi_setup_dma(hc_spi);
	if (ret) {
		return ret;
	}

	tx_status(spi, EC_SPI_RX_READY);
	hc_spi->state = SPI_HOST_CMD_STATE_READY_TO_RX;

	/* Configure CS interrupt once everything is ready. */
	gpio_init_callback(&hc_spi->cs_callback, gpio_cb_nss, BIT(hc_spi->cs.pin));
	gpio_add_callback(hc_spi->cs.port, &hc_spi->cs_callback);
	gpio_pin_interrupt_configure(hc_spi->cs.port, hc_spi->cs.pin, GPIO_INT_EDGE_BOTH);

	return ret;
}

static int ec_host_cmd_spi_send(const struct ec_host_cmd_backend *backend)
{
	struct ec_host_cmd_spi_ctx *hc_spi = (struct ec_host_cmd_spi_ctx *)backend->ctx;
	int ret = 0;
	int tx_size;

	dma_stop(hc_spi->dma_rx->dma_dev, hc_spi->dma_rx->channel);

	/* Add state bytes at the beginning and the end of the buffer to transmit */
	memcpy(hc_spi->tx_buf, out_preamble, sizeof(out_preamble));
	for (int i = 0; i < EC_SPI_PAST_END_LENGTH; i++) {
		hc_spi->tx_buf[sizeof(out_preamble) + hc_spi->tx->len + i] = EC_SPI_PAST_END;
	}
	tx_size = hc_spi->tx->len + sizeof(out_preamble) + EC_SPI_PAST_END_LENGTH;

