zephyrproject-rtos/zephyr/subsys/mgmt/ec_host_cmd/backends/ec_host_cmd_backend_spi_stm32.c
	hc_spi->state = SPI_HOST_CMD_STATE_SENDING;

	ret = reload_dma_tx(hc_spi, tx_size);
	if (ret) {
		LOG_ERR("Failed to send response");
	}

	return ret;
}

static const struct ec_host_cmd_backend_api ec_host_cmd_api = {
	.init = &ec_host_cmd_spi_init,
	.send = &ec_host_cmd_spi_send,
};

EC_HOST_CMD_SPI_DEFINE(ec_host_cmd_spi);

struct ec_host_cmd_backend *ec_host_cmd_backend_get_spi(struct gpio_dt_spec *cs)
{
	struct ec_host_cmd_spi_ctx *hc_spi = ec_host_cmd_spi.ctx;

	hc_spi->cs = *cs;

	return &ec_host_cmd_spi;
}

#ifdef CONFIG_PM_DEVICE
static int ec_host_cmd_spi_stm32_pm_action(const struct device *dev, enum pm_device_action action)
{
	const struct ec_host_cmd_backend *backend = (struct ec_host_cmd_backend *)dev->data;
	struct ec_host_cmd_spi_ctx *hc_spi = (struct ec_host_cmd_spi_ctx *)backend->ctx;
	const struct ec_host_cmd_spi_cfg *cfg = hc_spi->spi_config;
	int err;

	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		/* Set pins to active state */
		err = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
		if (err < 0) {
			return err;
		}

		/* Enable device clock */
		err = clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				       (clock_control_subsys_t)&cfg->pclken[0]);
		if (err < 0) {
			return err;
		}
		/* Enable CS interrupts. */
		if (hc_spi->cs.port) {
			gpio_pin_interrupt_configure_dt(&hc_spi->cs, GPIO_INT_EDGE_BOTH);
		}

		break;
	case PM_DEVICE_ACTION_SUSPEND:
#ifdef SPI_SR_BSY
		/* Wait 10ms for the end of transaction to prevent corruption of the last
		 * transfer
		 */
		WAIT_FOR((LL_SPI_IsActiveFlag_BSY(cfg->spi) == 0), 10 * USEC_PER_MSEC, NULL);
#endif
		/* Disable unnecessary interrupts. */
		if (hc_spi->cs.port) {
			gpio_pin_interrupt_configure_dt(&hc_spi->cs, GPIO_INT_DISABLE);
		}

		/* Stop device clock. */
		err = clock_control_off(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
					(clock_control_subsys_t)&cfg->pclken[0]);
		if (err != 0) {
			return err;
		}

		/* Move pins to sleep state */
		err = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLEEP);
		if ((err < 0) && (err != -ENOENT)) {
			/* If returning -ENOENT, no pins where defined for sleep mode. */
			return err;
		}

		break;
	default:
		return -ENOTSUP;
	}

	return 0;
}
#endif /* CONFIG_PM_DEVICE */

PM_DEVICE_DT_DEFINE(DT_CHOSEN(zephyr_host_cmd_spi_backend), ec_host_cmd_spi_stm32_pm_action);

DEVICE_DT_DEFINE(DT_CHOSEN(zephyr_host_cmd_spi_backend), NULL,
		 PM_DEVICE_DT_GET(DT_CHOSEN(zephyr_host_cmd_spi_backend)), &ec_host_cmd_spi, NULL,
		 PRE_KERNEL_1, CONFIG_EC_HOST_CMD_INIT_PRIORITY, NULL);

#ifdef CONFIG_EC_HOST_CMD_INITIALIZE_AT_BOOT
static int host_cmd_init(void)
{
	struct gpio_dt_spec cs = GPIO_DT_SPEC_GET(DT_CHOSEN(zephyr_host_cmd_spi_backend), cs_gpios);

	ec_host_cmd_init(ec_host_cmd_backend_get_spi(&cs));

	return 0;
}
SYS_INIT(host_cmd_init, POST_KERNEL, CONFIG_EC_HOST_CMD_INIT_PRIORITY);

#endif
